import React from 'react';
import {
  Modal,
  ModalOverlay,
  ModalContent,
  ModalHeader,
  ModalFooter,
  ModalBody,
  ModalCloseButton,
  Button,
} from '@chakra-ui/react';

interface Props {}

const TermOfUseModal = (props: any) => {
  return (
    <Modal isOpen={props.isOpen} onClose={props.onClose} size="3xl">
      <ModalOverlay />
      <ModalContent>
        <ModalHeader>قوانین نیمکت آکادمی</ModalHeader>
        <ModalCloseButton />
        <ModalBody>
          سیاست حریم خصوصی نیمکت آکادمی با تاکید بر احترامی که برای حریم شخصی
          کاربران قائل است، برای سفارش، ثبت نظر یا استفاده از برخی امکانات وب
          سایت اطلاعاتی را از کاربران درخواست می‌کند تا بتواند خدماتی امن و
          مطمئن را به کابران ارائه دهد. برای نمونه می‌توان به اطلاعاتی مانند
          ایمیل، شماره همراه، نام و ... اشاره نمود. لازم به ذکر است تمام مکاتبات
          نیمکت آکادمی از طریق ایمیل و شماره همراهی که مخاطب در پروفایل خود ثبت
          می‌کند صورت می‌گیرد. نیمکت آکادمی برای اطلاع رسانی جشنواره‌ها، انتشار
          آموزش‌های جدید و ... برای مخاطبان سایت ایمیل یا پیامک ارسال می‌کند. در
          صورتی که مخاطب تمایل به دریافت اینگونه ایمیل‌ها نداشته باشند می‌توانند
          با استفاده از لینک مربوط به لغو اشتراک خبرنامه موجود در انتهای ایمیل
          دریافتی، اقدام نمایند. لازم به ذکر است، حفظ و نگهداری رمز عبور بر عهده
          مخاطب می‌باشد و لذا برای جلوگیری از هرگونه سوء استفاده احتمالی،
          کاربران نباید آن اطلاعات را برای شخص دیگری فاش نمایند. نیمکت آکادمی
          هویت شخصی مخاطبان را محرمانه می‌داند و اطلاعات شخصی آنان را به هیچ شخص
          یا سازمان دیگری منتقل نمی‌کند. نیمکت آکادمی برای حفاظت و نگهداری
          اطلاعات و حریم شخصی کاربران همه توان خود را به کار می‌گیرد و امیدوار
          است که تجربه‌ی خریدی امن، راحت و خوشایند را برای همه مخاطبان فراهم
          آورد. شرایط استفاده از دوره‌های نیمکت آکادمی شما پس از پرداخت شهریه
          دوره و ثبت نام در دوره، دانشجوی دوره شناخته می شوید. پس از ثبت نام در
          دوره محتوای نیمکت آکادمی در اختیار شما قرار می گیرد. این محتوا تنها
          برای استفاده توسط دانشجویان دوره است پس شما حق بازنشر محتوای دوره اعم
          از ویدئوها، پروژه‌ها و … را در هیچ قالب و کانالی نخواهید داشت و در
          صورت مشاهده پیگرد قانونی خواهد داشت. با توجه به حقوق مالکیت معنوی و
          تفاهم نامه‌ای که نیمکت آکادمی با سایر ذی‌نفعان هر دوره نیمکت آکادمی
          دارد، امکان دانلود ویدئوها در دوره‌های نیمکت آکادمی وجود ندارد و
          دانشجوی این دوره‌ها باید ویدئوها را تنها به صورت آنلاین و از طریق
          وبسایت نیمکت آکادمی مشاهده نماید. دسترسی به دوره‌های نیمکت آکادمی فقط
          برای مدت مشخص و محدودی که برای هر دوره در قسمت مهلت دوره تعیین شده
          است، می باشد ودسترسی کامل دانشجو به خدمات ارزش افزوده دوره‌های نیمکت
          آکادمی (از قبیل محتوای دوره(در روش خرید اشتراک)، ارسال و تصحیح پروژه و
          تمرین‌ها، فارغ‌التحصیلی و دریافت گواهینامه پایان دوره و...) فقط برای
          مدت مشخص و محدودی که برای هر دوره در قسمت مهلت دوره تعیین شده است، و
          دانشجو می‌تواند برای دسترسی بیشتر، با پرداخت مبلغ تمدید دوره و یا
          پرداخت حق اشتراک هر بار برای مدت زمان مشخص دسترسی خود به آن دوره را
          تمدید کند. 3-1- توجه داشته باشید همانطور که در بند 1 عنوان شد این
          محدودیت شامل محتوای دوره نیست و شما پس از پرداخت شهریه و ثبت نام در
          دوره‌های نیمکت آکادمی بدون محدودیت زمانی به محتوای آن دسترسی خواهید
          داشت. 3-2- دسترسی به محتوا در روش خرید حق اشتراک نیز شامل محدودیت
          خواهد بود و صرفا با تمدید مجدد اشتراک دسترسی به خدمات نیمکت آکادمی
          میسر خواهد بود. 3-3- مدت زمانی که (راهنمای علمی دوره) جهت تصحیح پروژه
          یا تمرین‌های ارسالی دانشجو صرف می‌شود به صورت اتوماتیک و سیستمی به
          مجموع زمان دسترسی دانشجو به دوره اضافه خواهد شد. پس از پایان مدت زمان
          تعیین شده و عدم تمدید دوره، صرفا به محتوای دوره دسترسی خواهید داشت.
          شرایط خرید هنگام خرید دوره به ثبت کامل و دقیق نام و نام‌خانوادگی دقت
          گردد زیرا گواهی نامه دوره فقط به نام خریدار قابل صدور است و در پایان
          دوره جهت احراز هویت، نام و نام خانوادگی خریدار با تصویر کارت ملی تطابق
          داده خواهد شد. کاربران دقت نمایند که به دلیل فرایندهای مالی و تسهیم حق
          السهم ذی النفعان هر دوره،‌ امکان بازگشت هزینه پرداخت شده پس از خرید
          وجود ندارد لذا در خرید خود دقت نمایند. در صورتی که همه شرایط زیر
          همزمان برقرار باشد امکان جابه‌جابی دوره خریداری شده با دوره‌های دیگر
          برای یک بار وجود دارد: الف) مدرک دوره خریداری شده با مدرک دوره‌‌ای که
          قصد جابه‌جایی دارید یکسان باشد. (به عنوان مثال دوره‌ای با مدرک دانشگاه
          صنعتی شریف فقط با دوره‌ای که مدرک دانشگاه صنعتی شریف داشته باشد قابل
          جابه‌جایی است و یا دوره‌ای با مدرک نیمکت آکادمی فقط با دوره‌ای که مدرک
          نیمکت آکادمی داشته باشد قابل جابه‌جایی است) ب) درصد پیشرفت شما در دوره
          خریداری شده کمتر از ۱۰ درصد باشد. ج) درخواست جابه‌جایی دوره باید در
          همان ماه خرید دوره باشد. به عنوان مثال اگر شما دوره‌ای را در ماه بهمن
          خریداری کرده‌اید فقط در همان ماه فرصت دارید دوره را جابه‌جا کنید و در
          ماه‌های بعد این امکان وجود ندارد. به منظور جابه‌جایی دوره خریداری شده
          با دوره‌های دیگر، درصورتی که قیمت دوره آموزشی خریداری شده فعلی بیشتر
          از دوره‌ مورد نظر باشد نیمکت آکادمی در خرید بعدی با ارایه کد تخفیف
          مبلغ مابه التفاوت را محاسبه می نماید. و درصورتی که قیمت دوره آموزشی
          موردنظر بیشتر از دوره آموزشی خریداری شده فعلی باشد دانشجو بایستی نسبت
          به پرداخت مابه‌التفاوت مطابق شرایط اعلامی از سوی پشتیبانی نیمکت آکادمی
          اقدام نماید. شرایط فارغ‌التحصیلی هنگام خرید دوره به ثبت کامل و دقیق
          نام و نام­خانوادگی دقت گردد زیرا گواهی‌نامه دوره فقط به نام خریدار
          قابل صدور است و در پایان دوره جهت احراز هویت، نام و نام خانوادگی
          خریدار با تصویر کارت ملی تطابق داده خواهد شد.برای فارغ‌التحصیلی و
          دریافت گواهی‌نامه دوره، ارسال تمامی تمرین‌ها و پروژه‌های الزامی ضروری
          است. پس از پایان دوره و درصورتیکه دانشجو بتواند دوره را با موفقیت و
          کسب نمره قبولی به پایان رساند، لازم است نسبت به ارسال تصویر واضح و
          مشخص از کارت ملی (درمورد دانشجویان غیرایرانی: صفحه مشخصات در گذرنامه
          معتبر) اقدام نمایند. با ارسال اطلاعات وی برای موسسه برگزار‌کننده‌ی
          دوره و پس از طی تشریفات اداری، گواهی‌نامه‌ی پایان دوره قابل صدور است.
          درصورت تقاضای دریافت گواهی نامه به صورت فیزیکی، با پرداخت هزینه ارسال
          آن، نیمکت آکادمی گواهینامه موردنظر را به نشانی اعلام شده توسط دانشجو
          ارسال خواهد کرد. برای دانشجویان ساکن تهران امکان دریافت حضوری
          گواهینامه نیز وجود دارد دانشجو تعهد دارد که تمام دوره را شخصا بگذراند.
          نیمکت آکادمی می‌تواند در صورت لزوم مصاحبه‌ای با فارغ التحصیلان دوره
          انجام دهد و اگر مشخص شود که دوره توسط ایشان طی نشده است این اختیار را
          دارد تا از ارائه گواهی­نامه پایان دوره به ایشان خودداری کند. شرایط
          دوره زمان موردنیاز برای گذراندن دوره، براساس استانداردهای جهانی
          Massive Open Online Courses (MOOC) برای دوره­های مجازی، مجموع زمان
          لازم برای مشاهده ویدیوها، انجام کوییزها، حل تمارین و ارائه پروژه‌ها
          است و لزوماْ برابر با مدت زمان ویدئوهای دوره نیست. نیمکت آکادمی زمان
          موردنیاز برای گذراندن دوره‌ها را براین اساس محاسبه و در صفحه هر دوره
          درج نموده است. به دلیل حفظ حریم شخصی اساتید، اطلاعات تماس آن‌ها (ایمیل
          و شماره همراه) محرمانه است و نیمکت آکادمی از ارائه اطلاعات فوق به
          کاربران و دانشجویان و سایرین معذور است. دانشجو تعهد دارد که در هیچ‌ یک
          از تکالیف، آزمون‌ها و پروژه‌ها تقلب نکند. درصورتی که مشخص شود در طی
          دوره تقلب نموده است نمره صفر برای وی منظور می‌شود و نیمکت آکادمی حق
          دارد دسترسی وی را به دوره حذف نماید. دانشجو تعهد دارد جواب هیچ یک از
          تکالیف، آزمون‌ها و پروژه‌ها را با دیگران به هیچ نحو و در هیچ زمانی به
          اشتراک نگذارد. برای پاسخ به هریک از پروژه‌ها، یک یا چند بار امکان
          ارسال پاسخ مهیا است. تعداد امکان ارسال هر پروژه در صفحه همان پروژه و
          در زمان ارسال مشخص است. توجه کنید که درصورت هر بار ارسال مجدد پاسخ،
          درصدی از نمره شما کسر خواهد شد که برای هر پروژه متفاوت است و در صفحه
          پروژه قابل مشاهده است. دانشجو تعهد دارد که تمام دوره را شخصا بگذراند.
          نیمکت آکادمی می‌تواند در صورت لزوم مصاحبه‌ای با فارغ التحصیلان دوره
          انجام دهد و اگر مشخص شود که دوره توسط ایشان طی نشده است این اختیار را
          دارد تا از ارائه گواهی‌نامه پایان دوره به ایشان خودداری کند.
        </ModalBody>

        <ModalFooter>
          <Button colorScheme="primary" mr={3} onClick={props.onClose}>
            خواندم
          </Button>
        </ModalFooter>
      </ModalContent>
    </Modal>
  );
};

export default TermOfUseModal;
